Ac6Embedded/svd-microchip/PIC32CK_GC/PIC32CK1012GC01048.svd
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0xC</addressOffset>
               <size>16</size>
               <resetValue>0x0040</resetValue>
               <fields>
                  <field>
                     <name>QERR</name>
                     <description>Quadrature Error Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDXERR</name>
                     <description>Index Error Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MPERR</name>
                     <description>Missing Pulse Error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINERR</name>
                     <description>Window Error Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HERR</name>
                     <description>Hall Error Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Direction Status Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESCBUFV</name>
                     <description>Prescaler Buffer Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTERBUFV</name>
                     <description>Filter Buffer Valid</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCBUFV0</name>
                     <description>Compare Channel 0 Buffer Valid</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCBUFV1</name>
                     <description>Compare Channel 1 Buffer Valid</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xF</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>Control B Synchronization Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STATUS</name>
                     <description>Status Synchronization Busy</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESC</name>
                     <description>Prescaler Synchronization Busy</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTER</name>
                     <description>Filter Synchronization Busy</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNT</name>
                     <description>Count Synchronization Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC0</name>
                     <description>Compare Channel 0 Synchronization Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1</name>
                     <description>Compare Channel 1 Synchronization Busy</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRESC</name>
               <description>Prescaler Value</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>Prescaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>No division</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide by 4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide by 64</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Divide by 256</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV512</name>
                           <description>Divide by 512</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV1024</name>
                           <description>Divide by 1024</description>
                           <value>10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FILTER</name>
               <description>Filter Value</description>
               <addressOffset>0x15</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FILTER</name>
                     <description>Filter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRESCBUF</name>
               <description>Prescaler Buffer Value</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>PRESCBUF</name>
                     <description>Prescaler Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>PRESCBUFSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>No division</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>Divide by 4</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>Divide by 8</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>Divide by 32</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>Divide by 64</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV256</name>
                           <description>Divide by 256</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV512</name>
                           <description>Divide by 512</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV1024</name>
                           <description>Divide by 1024</description>
                           <value>10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FILTERBUF</name>
               <description>Filter Buffer Value</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>FILTERBUF</name>
                     <description>Filter Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>COUNT</name>
               <description>Counter Value</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CC[%s]</name>
               <description>Channel n Compare Value</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CC</name>
                     <description>Channel Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCBUF[%s]</name>
               <description>Channel n Compare Buffer Value</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCBUF</name>
                     <description>Channel Compare Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
