Ac6Embedded/svd-microchip/PIC32CK_GC/PIC32CK1012GC01048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TRNG</name>
         <version>035971d0</version>
         <description>True Random Generator</description>
         <baseAddress>0x45024000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TRNG</name>
            <description>True Random Generator</description>
            <value>147</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDYEO</name>
                     <description>Data Ready Event Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <description>Output Data</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>USB</name>
         <version>036131d0</version>
         <description>Full-Speed Universal Serial Bus</description>
         <baseAddress>0x4502A000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>USB_OTHER</name>
            <description>USB Other Interrupt</description>
            <value>150</value>
         </interrupt>
         <interrupt>
            <name>USB_SOF</name>
            <description>USB SOF Interrupt</description>
            <value>151</value>
         </interrupt>
         <interrupt>
            <name>USB_TRCPT0</name>
            <description>USB TRCPT0 Interrupt</description>
            <value>152</value>
         </interrupt>
         <interrupt>
            <name>USB_TRCPT1</name>
            <description>USB TRCPT1 Interrupt</description>
            <value>153</value>
         </interrupt>
         <registers>
            <cluster>
               <name>DEVICE</name>
               <description>USB is Device</description>
               <headerStructName>UsbDevice</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>DEVICE</name>
                              <description>Device Mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HOST</name>
                              <description>Host Mode</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>QOSCTRL</name>
                  <description>USB Quality Of Service</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x0F</resetValue>
                  <fields>
                     <field>
                        <name>CQOS</name>
                        <description>Configuration Quality of Service</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>DQOS</name>
                        <description>Data Quality of Service</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>DEVICE Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0001</resetValue>
                  <fields>
                     <field>
                        <name>DETACH</name>
                        <description>Detach</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPDCONF</name>
                        <description>Speed Configuration</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPDCONFSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>FS : Full Speed</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>LS : Low Speed</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>HS : High Speed capable</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HSTM</name>
                              <description>HSTM: High Speed Test Mode (force high-speed mode for test mode)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NREPLY</name>
                        <description>No Reply</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTJ</name>
                        <description>Test mode J</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTK</name>
                        <description>Test mode K</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTPCKT</name>
                        <description>Test packet mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OPMODE2</name>
                        <description>Specific Operational Mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GNAK</name>
                        <description>Global NAK</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMHDSK</name>
                        <description>Link Power Management Handshake</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LPMHDSKSelect</name>
                           <enumeratedValue>
                              <name>NO</name>
                              <description>No handshake. LPM is not supported</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACK</name>
                              <description>ACK</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NYET</name>
                              <description>NYET</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STALL</name>
                              <description>STALL</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADD</name>
                  <description>DEVICE Device Address</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DADD</name>
                        <description>Device Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>ADDEN</name>
                        <description>Device Address Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>DEVICE Status</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x40</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Speed Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>Full-speed mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>Low-speed mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-speed mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LINESTATE</name>
                        <description>USB Line State Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LINESTATESelect</name>
                           <enumeratedValue>
                              <name>0</name>
                              <description>SE0/RESET</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>FS-J or LS-K State</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2</name>
                              <description>FS-K or LS-J State</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSMSTATUS</name>
                  <description>Finite State Machine Status</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>FSMSTATE</name>
                        <description>Fine State Machine Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>FSMSTATESelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ON</name>
                              <description>ON (L0). It corresponds to the Idle and Active states</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>SUSPEND (L2)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLEEP</name>
                              <description>SLEEP (L1)</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DNRESUME</name>
                              <description>DNRESUME. Down Stream Resume.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPRESUME</name>
                              <description>UPRESUME. Up Stream Resume.</description>
                              <value>0x20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESET</name>
                              <description>RESET. USB lines Reset.</description>
                              <value>0x40</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FNUM</name>
                  <description>DEVICE Device Frame Number</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>MFNUM</name>
                        <description>Micro Frame Number</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>FNCERR</name>
                        <description>Frame Number CRC Error</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
